/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   sorting_commands_1.c                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fdarkhaw <fdarkhaw@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/20 17:25:17 by fdarkhaw          #+#    #+#             */
/*   Updated: 2021/12/20 18:00:30 by fdarkhaw         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/push_swap.h"

// void	ra(t_data *list_a)
// {}

// void	rb(t_data *list_b)
// {}

// void	rr(t_data *list_a, t_data *list_b)
// {
// 	ra(list_a);
// 	rb(list_b);
// }
/*
sa (поменять местами a): поменять местами два верхних числа в A
sb (swap b): поменять местами два верхних числа в B
сс: са + сб
ra (поверните a): верхнее число в A переходит в нижнюю часть A
rb (повернуть b): верхнее число в B переходит в нижнюю часть B
rr: ra + rb
rra (обратный поворот a): нижнее число в A переходит в верхнюю часть A
rra (обратное вращение b): нижнее число в B переходит в верхнюю часть B
ррр: рра + ррб
pa (push a): верхнее число в B переходит в верхнюю часть A
pb (нажмите b): верхнее число в A переходит в верхнюю часть B
*/